Sunewst/garden-board/boards.txt
adafruit_feather_esp32c6.menu.DebugLevel.none=None
adafruit_feather_esp32c6.menu.DebugLevel.none.build.code_debug=0
adafruit_feather_esp32c6.menu.DebugLevel.error=Error
adafruit_feather_esp32c6.menu.DebugLevel.error.build.code_debug=1
adafruit_feather_esp32c6.menu.DebugLevel.warn=Warn
adafruit_feather_esp32c6.menu.DebugLevel.warn.build.code_debug=2
adafruit_feather_esp32c6.menu.DebugLevel.info=Info
adafruit_feather_esp32c6.menu.DebugLevel.info.build.code_debug=3
adafruit_feather_esp32c6.menu.DebugLevel.debug=Debug
adafruit_feather_esp32c6.menu.DebugLevel.debug.build.code_debug=4
adafruit_feather_esp32c6.menu.DebugLevel.verbose=Verbose
adafruit_feather_esp32c6.menu.DebugLevel.verbose.build.code_debug=5

adafruit_feather_esp32c6.menu.EraseFlash.none=Disabled
adafruit_feather_esp32c6.menu.EraseFlash.none.upload.erase_cmd=
adafruit_feather_esp32c6.menu.EraseFlash.all=Enabled
adafruit_feather_esp32c6.menu.EraseFlash.all.upload.erase_cmd=-e

adafruit_feather_esp32c6.menu.ZigbeeMode.default=Disabled
adafruit_feather_esp32c6.menu.ZigbeeMode.default.build.zigbee_mode=
adafruit_feather_esp32c6.menu.ZigbeeMode.default.build.zigbee_libs=
adafruit_feather_esp32c6.menu.ZigbeeMode.ed=Zigbee ED (end device)
adafruit_feather_esp32c6.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
adafruit_feather_esp32c6.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api.ed -lzboss_stack.ed -lzboss_port.native
adafruit_feather_esp32c6.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
adafruit_feather_esp32c6.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
adafruit_feather_esp32c6.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.native

###################################################

garden_board_esp32c6.name=Engineering Room Garden Board


garden_board_esp32c6.bootloader.tool=esptool_py
garden_board_esp32c6.bootloader.tool.default=esptool_py

garden_board_esp32c6.upload.tool=esptool_py
garden_board_esp32c6.upload.tool.default=esptool_py
garden_board_esp32c6.upload.tool.network=esp_ota

garden_board_esp32c6.upload.maximum_size=1310720
garden_board_esp32c6.upload.maximum_data_size=327680
garden_board_esp32c6.upload.flags=
garden_board_esp32c6.upload.extra_flags=
garden_board_esp32c6.upload.use_1200bps_touch=false
garden_board_esp32c6.upload.wait_for_upload_port=false

garden_board_esp32c6.serial.disableDTR=false
garden_board_esp32c6.serial.disableRTS=false

garden_board_esp32c6.build.tarch=riscv32
garden_board_esp32c6.build.target=esp
garden_board_esp32c6.build.mcu=esp32c6
garden_board_esp32c6.build.core=esp32
garden_board_esp32c6.build.variant=garden_board_esp32c6
garden_board_esp32c6.build.board=GARDEN_BOARD_ESP32C6
garden_board_esp32c6.build.bootloader_addr=0x0

garden_board_esp32c6.build.cdc_on_boot=0
garden_board_esp32c6.build.f_cpu=160000000L
garden_board_esp32c6.build.flash_size=4MB
garden_board_esp32c6.build.flash_freq=80m
garden_board_esp32c6.build.flash_mode=qio
garden_board_esp32c6.build.boot=qio
garden_board_esp32c6.build.partitions=default
garden_board_esp32c6.build.defines=

## IDE 2.0 Seems to not update the value
garden_board_esp32c6.menu.JTAGAdapter.default=Disabled
garden_board_esp32c6.menu.JTAGAdapter.default.build.copy_jtag_files=0
garden_board_esp32c6.menu.JTAGAdapter.builtin=Integrated USB JTAG
garden_board_esp32c6.menu.JTAGAdapter.builtin.build.openocdscript=esp32c6-builtin.cfg
garden_board_esp32c6.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
garden_board_esp32c6.menu.JTAGAdapter.external=FTDI Adapter
garden_board_esp32c6.menu.JTAGAdapter.external.build.openocdscript=esp32c6-ftdi.cfg
garden_board_esp32c6.menu.JTAGAdapter.external.build.copy_jtag_files=1
garden_board_esp32c6.menu.JTAGAdapter.bridge=ESP USB Bridge
garden_board_esp32c6.menu.JTAGAdapter.bridge.build.openocdscript=esp32c6-bridge.cfg
garden_board_esp32c6.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

garden_board_esp32c6.menu.CDCOnBoot.default=Disabled
garden_board_esp32c6.menu.CDCOnBoot.default.build.cdc_on_boot=0
garden_board_esp32c6.menu.CDCOnBoot.cdc=Enabled
garden_board_esp32c6.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

garden_board_esp32c6.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
garden_board_esp32c6.menu.PartitionScheme.default.build.partitions=default
garden_board_esp32c6.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
garden_board_esp32c6.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
garden_board_esp32c6.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
garden_board_esp32c6.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
garden_board_esp32c6.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
garden_board_esp32c6.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
garden_board_esp32c6.menu.PartitionScheme.minimal.build.partitions=minimal
garden_board_esp32c6.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
garden_board_esp32c6.menu.PartitionScheme.no_ota.build.partitions=no_ota
garden_board_esp32c6.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
garden_board_esp32c6.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
garden_board_esp32c6.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
garden_board_esp32c6.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
garden_board_esp32c6.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
garden_board_esp32c6.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
garden_board_esp32c6.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
garden_board_esp32c6.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
garden_board_esp32c6.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
garden_board_esp32c6.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
garden_board_esp32c6.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
garden_board_esp32c6.menu.PartitionScheme.huge_app.build.partitions=huge_app
garden_board_esp32c6.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
garden_board_esp32c6.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
garden_board_esp32c6.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
garden_board_esp32c6.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
garden_board_esp32c6.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
garden_board_esp32c6.menu.PartitionScheme.fatflash.build.partitions=ffat
garden_board_esp32c6.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
garden_board_esp32c6.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
garden_board_esp32c6.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
garden_board_esp32c6.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
garden_board_esp32c6.menu.PartitionScheme.rainmaker=RainMaker 4MB
garden_board_esp32c6.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
garden_board_esp32c6.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
garden_board_esp32c6.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
garden_board_esp32c6.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
garden_board_esp32c6.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
garden_board_esp32c6.menu.PartitionScheme.zigbee=Zigbee 4MB with spiffs
garden_board_esp32c6.menu.PartitionScheme.zigbee.build.partitions=zigbee
garden_board_esp32c6.menu.PartitionScheme.zigbee.upload.maximum_size=1310720
garden_board_esp32c6.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
garden_board_esp32c6.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
garden_board_esp32c6.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
garden_board_esp32c6.menu.PartitionScheme.custom=Custom
garden_board_esp32c6.menu.PartitionScheme.custom.build.partitions=
garden_board_esp32c6.menu.PartitionScheme.custom.upload.maximum_size=16777216

