Sunewst/garden-board/boards.txt
garden_board_esp32c6.menu.CPUFreq.160=160MHz (WiFi)
garden_board_esp32c6.menu.CPUFreq.160.build.f_cpu=160000000L
garden_board_esp32c6.menu.CPUFreq.120=120MHz (WiFi)
garden_board_esp32c6.menu.CPUFreq.120.build.f_cpu=120000000L
garden_board_esp32c6.menu.CPUFreq.80=80MHz (WiFi)
garden_board_esp32c6.menu.CPUFreq.80.build.f_cpu=80000000L
garden_board_esp32c6.menu.CPUFreq.40=40MHz
garden_board_esp32c6.menu.CPUFreq.40.build.f_cpu=40000000L
garden_board_esp32c6.menu.CPUFreq.20=20MHz
garden_board_esp32c6.menu.CPUFreq.20.build.f_cpu=20000000L
garden_board_esp32c6.menu.CPUFreq.10=10MHz
garden_board_esp32c6.menu.CPUFreq.10.build.f_cpu=10000000L

garden_board_esp32c6.menu.FlashMode.qio=QIO
garden_board_esp32c6.menu.FlashMode.qio.build.flash_mode=dio
garden_board_esp32c6.menu.FlashMode.qio.build.boot=qio
garden_board_esp32c6.menu.FlashMode.dio=DIO
garden_board_esp32c6.menu.FlashMode.dio.build.flash_mode=dio
garden_board_esp32c6.menu.FlashMode.dio.build.boot=dio

garden_board_esp32c6.menu.FlashFreq.80=80MHz
garden_board_esp32c6.menu.FlashFreq.80.build.flash_freq=80m
garden_board_esp32c6.menu.FlashFreq.40=40MHz
garden_board_esp32c6.menu.FlashFreq.40.build.flash_freq=40m

garden_board_esp32c6.menu.UploadSpeed.921600=921600
garden_board_esp32c6.menu.UploadSpeed.921600.upload.speed=921600
garden_board_esp32c6.menu.UploadSpeed.115200=115200
garden_board_esp32c6.menu.UploadSpeed.115200.upload.speed=115200
garden_board_esp32c6.menu.UploadSpeed.256000.windows=256000
garden_board_esp32c6.menu.UploadSpeed.256000.upload.speed=256000
garden_board_esp32c6.menu.UploadSpeed.230400.windows.upload.speed=256000
garden_board_esp32c6.menu.UploadSpeed.230400=230400
garden_board_esp32c6.menu.UploadSpeed.230400.upload.speed=230400
garden_board_esp32c6.menu.UploadSpeed.460800.linux=460800
garden_board_esp32c6.menu.UploadSpeed.460800.macosx=460800
garden_board_esp32c6.menu.UploadSpeed.460800.upload.speed=460800
garden_board_esp32c6.menu.UploadSpeed.512000.windows=512000
garden_board_esp32c6.menu.UploadSpeed.512000.upload.speed=512000

garden_board_esp32c6.menu.DebugLevel.none=None
garden_board_esp32c6.menu.DebugLevel.none.build.code_debug=0
garden_board_esp32c6.menu.DebugLevel.error=Error
garden_board_esp32c6.menu.DebugLevel.error.build.code_debug=1
garden_board_esp32c6.menu.DebugLevel.warn=Warn
garden_board_esp32c6.menu.DebugLevel.warn.build.code_debug=2
garden_board_esp32c6.menu.DebugLevel.info=Info
garden_board_esp32c6.menu.DebugLevel.info.build.code_debug=3
garden_board_esp32c6.menu.DebugLevel.debug=Debug
garden_board_esp32c6.menu.DebugLevel.debug.build.code_debug=4
garden_board_esp32c6.menu.DebugLevel.verbose=Verbose
garden_board_esp32c6.menu.DebugLevel.verbose.build.code_debug=5

garden_board_esp32c6.menu.EraseFlash.none=Disabled
garden_board_esp32c6.menu.EraseFlash.none.upload.erase_cmd=
garden_board_esp32c6.menu.EraseFlash.all=Enabled
garden_board_esp32c6.menu.EraseFlash.all.upload.erase_cmd=-e

garden_board_esp32c6.menu.ZigbeeMode.default=Disabled
garden_board_esp32c6.menu.ZigbeeMode.default.build.zigbee_mode=
garden_board_esp32c6.menu.ZigbeeMode.default.build.zigbee_libs=
garden_board_esp32c6.menu.ZigbeeMode.ed=Zigbee ED (end device)
garden_board_esp32c6.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
garden_board_esp32c6.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api.ed -lzboss_stack.ed -lzboss_port.native
garden_board_esp32c6.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
garden_board_esp32c6.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
garden_board_esp32c6.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.native